# -*- coding: utf-8 -*-
# Stage three - first pass at local stemmata

from populate_db import Reading, LacunaReading, AllBut, UNCL, INIT

all_mss = set(['P75', '01', '02', '03', '05', '07', '011', '013', '017', '019', '021', '022', '028', '030', '031', '032', '034', '036', '037', '038', '044', '045', '047', '063', '091', '0141', '0211'])

struct = {
    '21': {
        '2': [
            Reading('a', u'ηθελον', AllBut('01', '091'), INIT),
            Reading('b', u'ηλθον', ['01'], 'a'),
            LacunaReading(['091'])],
        '6-8': [
            Reading('a', u'λαβειν αυτον', AllBut('05', '032', '044', '091'), UNCL),
            Reading('b', u'αυτον λαβειν', ['05', '032', '044'], UNCL),
            LacunaReading(['091'])],
        '20-24': [
            Reading('a', u'το πλοιον εγενετο', ['01', '07', '013', '017', '021', '028', '030', '031', '034', '036', '037', '038', '045', '047', '063', '0211'], UNCL),
            Reading('b', u'εγενετο το πλοιον', ['P75', '02', '03', '011', '019', '022', '032', '044', '0141'], UNCL),
            Reading('c', u'το πλοιον εγενηθη', ['05'], UNCL),
            LacunaReading(['091'])],
        '28-30': [
            Reading('a', u'της γης', AllBut('01', '0211', '091', 'P75'), UNCL),
            Reading('b', u'την γην', ['01', '0211'], UNCL),
            LacunaReading(['091', 'P75'])],
        '36': [
            Reading('a', u'υπηγον', AllBut('01', '091'), INIT),
            Reading('b', u'υπηντησεν', ['01'], 'a'),
            LacunaReading(['091'])],
    },
    '22': {
        '3': [
            Reading('a', '', AllBut('091', '0211'), INIT),
            Reading('b', u'τε', ['0211'], 'a'),
            LacunaReading(['091'])],
        '10': [
            Reading('a', u'ο', AllBut('038', '045', '091'), UNCL),
            Reading('b', '', ['038', '045'], UNCL),
            LacunaReading(['091'])],
        '12': [
            Reading('a', u'εστηκως', AllBut('01', '091'), INIT),
            Reading('b', u'εστως', ['01'], 'a'),
            LacunaReading(['091'])],
        '20': [
            Reading('a', u'ιδων', ['07', '011', '013', '017', '021', '028', '030', '031', '034', '036', '044', '045', '047', '063', '0141'], UNCL),
            Reading('b', u'ειδον', ['P75', '02', '03', '038'], UNCL),
            Reading('c', u'ειδεν', ['01', '05'], UNCL),
            Reading('d', u'ειδως', ['0211'], UNCL),
            LacunaReading(['091', '019', '022', '032', '037'])],

        '40-52': [
            Reading('a', u'εκεινο εις ο ενεβησαν οι μαθηται αυτου', AllBut('P75', '02', '03', '019', '022', '032', '044', '063', '091'), 'b'),
            Reading('b', '', ['P75', '02', '03', '019', '022', '032', '044', '063'], INIT),
            LacunaReading(['091'])],
        '40': [
            Reading('a', u'εκεινο', AllBut('P75', '02', '03', '05', '019', '022', '032', '044', '063', '0211', '091'), 'b'),
            Reading('b', '', ['05', '0211'], INIT),
            LacunaReading(['P75', '02', '03', '019', '022', '032', '044', '063', '091'])],
        '42': [
            Reading('a', u'εις', AllBut('P75', '02', '03', '019', '022', '032', '044', '034', '063', '091'), UNCL),
            Reading('b', '', ['034'], UNCL),
            LacunaReading(['P75', '02', '03', '019', '022', '032', '044', '063', '091'])],
        '46': [
            Reading('a', u'ενεβησαν', AllBut('P75', '02', '03', '019', '022', '032', '044', '063', '091', '037', '047'), INIT),
            Reading('b', u'ανεβησαν', ['037', '047'], 'a'),
            LacunaReading(['P75', '02', '03', '019', '022', '032', '044', '063', '091'])],
        '52': [
            Reading('a', u'αυτου', AllBut('P75', '01', '02', '03', '05', '019', '022', '032', '044', '063', '091'), INIT),
            Reading('b', u'του ιησου', ['01'], 'a'),
            Reading('c', u'ιησου', ['05'], 'a'),
            LacunaReading(['P75', '02', '03', '019', '022', '032', '044', '063', '091'])],

        '60': [
            Reading('a', u'συνεισηλθε', AllBut('01'), INIT),
            Reading('b', u'συνεληλυθι', ['01'], 'a')],
        '61': [
            Reading('a', '', AllBut('02'), INIT),
            Reading('b', u'ο ιησους', ['02'], 'a')],
        '62-66': [
            Reading('a', u'τοις μαθηταις αυτου', AllBut('01'), 'b'),
            Reading('b', u'αυτοις', ['01'], INIT)],
        '68-70': [
            Reading('a', u'ο ιησους', AllBut('034'), INIT),
            Reading('b', '', ['034'], 'a')],
        '76': [
            Reading('a', u'πλοιαριον', ['07', '011', '013', '021', '028', '030', '034', '036', '037', '038', '045', '047', '063'], UNCL),
            Reading('b', u'πλοιον', ['P75', '01', '02', '03', '05', '017', '019', '022', '032', '044', '091', '0141', '0211'], UNCL),
            LacunaReading(['031'])],
        '80': [
            Reading('a', u'μονοι', AllBut('05', '047'), INIT),
            Reading('b', u'μονον', ['05', '047'], 'a')],
        '88': [
            Reading('a', u'απηλθον', AllBut('01', '038', '031'), UNCL),
            Reading('b', u'εισηλθον', ['038'], UNCL),
            Reading('c', '', ['01'], UNCL),
            LacunaReading(['031'])],
    },
    '23': {
        '1': [
            Reading('a', '', AllBut('022', '031'), INIT),
            Reading('b', u'και', ['022'], 'a'),
            LacunaReading(['031'])],
        '3': [
            Reading('a', '', ['P75', '03', '019', '091'], INIT),
            Reading('b', u'δε', AllBut('P75', '01', '03', '05', '019', '091', '031'), 'a'),
            LacunaReading(['031', '01', '05'])],
        '4-10': [
            Reading('a', u'ηλθεν πλοιαρια εκ τιβεριαδος', ['02', '07', '011', '013', '028', '030', '031', '034', '037', '038', '045', '063', '0211'], UNCL),
            Reading('b', u'ηλθεν πλοια εκ τιβεριαδος', ['P75'], UNCL),
            Reading('c', u'ηλθεν πλοια εκ της τιβεριαδος', ['03', '032'], UNCL),
            Reading('d', u'ηλθον πλοιαρια εκ τιβεριαδος', ['021', '047', '036', '091'], UNCL),
            Reading('e', u'ηλθον πλοιαρια εκ της τιβεριαδος', ['022'], UNCL),
            Reading('f', u'πλοιαρια ηλθον εκ τιβεριαδος', ['017'], UNCL),
            Reading('g', u'πλοια ηλθεν εκ τιβεριαδος', ['044'], UNCL),
            Reading('h', u'πλοιαρια εκ τιβεριαδος ηλθον', ['019'], UNCL),
            Reading('i', u'πλοια εκ τιβεριαδος ηλθεν', ['0141'], UNCL),
            LacunaReading(['01', '05'])],
        '2-10': [
            Reading('a', u'αλλα ηλθεν πλοιαρια', AllBut('01', '05'), UNCL),
            Reading('b', u'επελθοντων ουν των πλοιων', ['01'], UNCL),
            Reading('c', u'αλλων πλοιαρειων ελθοντων', ['05'], UNCL)],

       '12-16': [
            Reading('a', u'εγγυς του τοπου', AllBut('032', '01'), UNCL),
            Reading('b', u'εγγυς ουσης', ['01'], UNCL),
            Reading('c', '', ['032'], UNCL)],
        '20-22': [
            Reading('a', u'εφαγον τον', AllBut('01'), UNCL),
            Reading('b', u'και εφαγον', ['01'], UNCL)],
        '26-30': [
            Reading('a', u'ευχαριστησαντος του κυριου', AllBut('05', '091', '02'), UNCL),
            Reading('b', u'ευχαριστησαντος του θεου', ['02'], 'a'),
            Reading('c', '', ['05', '091'], UNCL)],
    },
    '24': {
        '6': [
            Reading('a', u'ειδεν', AllBut('01', '013', '030'), UNCL),
            Reading('b', u'ειπεν', ['013'], 'a'),
            Reading('c', u'εγνω', ['030'], UNCL),
            LacunaReading(['01'])],
        '2-10': [
            Reading('a', u'οτε ουν ειδεν ο οχλος', AllBut('01'), UNCL),
            Reading('b', u'και ιδοντες', ['01'], UNCL)],
        '14': [
            Reading('a', u'ιησους', AllBut('038', '031', '063', '01', '013'), INIT),
            Reading('b', u'ο ιησους', ['038', '01'], 'a'),
            Reading('c', '', ['013'], 'a'),
            LacunaReading(['031', '063'])],
        '14-20': [
            Reading('a', u'ο ιησους ουκ εστιν εκει', AllBut('01', '031'), UNCL),
            Reading('b', u'ουκ ην εκει ο ιησους', ['01'], UNCL),
            LacunaReading(['031'])],
        '28': [
            Reading('a', u'αυτου', AllBut('01', '091', '063'), UNCL),
            Reading('b', '', ['01'], UNCL),
            LacunaReading(['091', '063'])],

        '30': [
            Reading('a', u'ενεβησαν', AllBut('P75', '01', '019', '05', '091', '063'), UNCL),
            Reading('b', u'ανεβησαν', ['P75', '01', '019'], UNCL),
            LacunaReading(['091', '063', '05'])],
        '31': [
            Reading('a', '', AllBut('030', '036', '063', '05', '0211', '091', '063'), INIT),
            Reading('b', u'και', ['030', '036', '0211'], 'a'),
            LacunaReading(['091', '063', '05'])],
        '32': [
            Reading('a', u'αυτοι', AllBut('05', '01', '028', '091', '063'), UNCL),
            Reading('c', '', ['01', '028'], UNCL),
            LacunaReading(['091', '063', '05'])],
        '30-32': [
            Reading('a', u'ενεβησαν αυτοι', AllBut('0211', '05', '091', '063'), UNCL),
            Reading('b', u'τοτε και αυτοι ενεβησαν', ['0211'], UNCL),
            LacunaReading(['091', '063', '05'])],
        '36': [
            Reading('a', u'τα', AllBut('05', '01', '091'), UNCL),
            Reading('b', u'το', ['01'], UNCL),
            LacunaReading(['091', '05'])],
        '38': [
            Reading('a', u'πλοια', AllBut('01', 'P75', '03', '05', '019', '022', '032', '044', '091', '063'), UNCL),
            Reading('b', u'πλοιαρια', ['P75', '03', '05', '019', '022', '032', '044'], UNCL),
            Reading('c', u'πλοιον', ['01'], UNCL),
            LacunaReading(['091', '063'])],
        '30-38': [
            Reading('a', u'ενεβησαν αυτοι εις τα πλοια', AllBut('05', '091', '063'), UNCL),
            Reading('b', u'ελαβον εαυτοις πλοιαρια', ['05'], UNCL),
            LacunaReading(['091', '063'])],

        '50-52': [
            Reading('a', u'τον ιησουν', AllBut('017', '091'), INIT),
            Reading('b', u'αυτον', ['017'], 'a'),
            LacunaReading(['091'])],
    }
}
